#ifndef COMBAT_NOISE_BOSS03_H
#define COMBAT_NOISE_BOSS03_H

#include "SndMgr.h"
#include "SpriteMgr.h"
#include <types.h>

typedef struct {
    /* 0x000 */ char unk_000[0x1A4];
    /* 0x1A4 */ s16  unk_1A4;
    /* 0x1A6 */ s16  unk_1A6;
    /* 0x1A8 */ s16  unk_1A8;
} Unk_From_NoisAppr;

typedef struct Boss03 Boss03;

typedef struct {
    /* 0x0 */ s32 unk0;
    /* 0x4 */ s32 unk4;
    /* 0x8 */ s32 unk8;
    /* 0xC */ s32 unkC;
} SubroutineArgs;

typedef struct {
    /* 0x00 */ u16   unk0;
    /* 0x02 */ u16   unk2;
    /* 0x04 */ u16   unk4;
    /* 0x06 */ u16   unk6;
    /* 0x08 */ u16   unk8;
    /* 0x0A */ u16   unkA;
    /* 0x0C */ u16   unkC;
    /* 0x0E */ u16   unkE;
    /* 0x10 */ void* unk10;
    /* 0x14 */ char  pad_14[0x8];
    /* 0x1C */ s32   unk1C;
    /* 0x20 */ void* unk20;
    /* 0x24 */ s32   unk24;
    /* 0x28 */ s32   unk28;
    /* 0x2C */ s32   unk2C;
} Boss03DataStruct;

struct Boss03 {
    /* 0x000 */ s16   unk0;
    /* 0x002 */ u8    unk2;
    /* 0x003 */ u8    unk3;
    /* 0x004 */ s16   unk4;
    /* 0x006 */ u8    unk6;
    /* 0x007 */ u8    unk7;
    /* 0x008 */ s16   unk8;
    /* 0x00A */ s16   unkA;
    /* 0x00C */ s16   unkC;
    /* 0x00E */ s16   unkE;
    /* 0x010 */ s16   unk10;
    /* 0x012 */ s16   unk12;
    /* 0x014 */ s16   unk14;
    /* 0x016 */ char  pad_016[0x2];
    /* 0x018 */ void* unk18;
    /* 0x01C */ s16   unk1C;
    /* 0x01E */ s16   unk1E;
    /* 0x020 */ s32   unk20;
    /* 0x024 */ s16   unk24;
    /* 0x026 */ s16   unk26;
    /* 0x028 */ s16   unk28;
    /* 0x02A */ s16   unk2A;
    /* 0x02C */ s16   unk2C;
    /* 0x02E */ s16   unk2E;
    /* 0x030 */ s16   unk30;
    /* 0x032 */ s16   unk32;
    /* 0x034 */ s16   unk34;
    /* 0x036 */ s16   unk36;
    /* 0x038 */ s16   unk38;
    /* 0x03A */ s16   unk3A;
    /* 0x03C */ s16   unk3C;
    /* 0x03E */ s16   unk3E;
    /* 0x040 */ s16   unk40;
    /* 0x042 */ s16   unk42;
    /* 0x044 */ s32   unk44;
    /* 0x048 */ s32   unk48;
    /* 0x04C */ s32   unk4C;
    /* 0x050 */ s32   unk50;
    /* 0x054 */ s32   unk54;
    /* 0x058 */ s32   unk58;
    /* 0x05C */ s32   unk5C;
    /* 0x060 */ s16   unk60;
    /* 0x062 */ s16   unk62;
    /* 0x064 */ s16   unk64;
    /* 0x066 */ s16   unk66;
    /* 0x068 */ s32   unk68;
    /* 0x06C */ s16   unk6C;
    /* 0x06E */ s16   unk6E;
    /* 0x070 */ s16   unk70;
    /* 0x072 */ s16   unk72;
    /* 0x074 */ s16   unk74;
    /* 0x076 */ s16   unk76;
    /* 0x078 */ s32   unk78;
    /* 0x07C */ s16   unk7C;
    /* 0x07E */ s16   unk7E;
    /* 0x080 */ s32   unk80;
    /* 0x084 */ s32   unk84;
    /* 0x088 */ s16   unk88;
    /* 0x08A */ s16   unk8A;
    /* 0x08C */ s32   unk8C;
    /* 0x090 */ s32   unk90;
    /* 0x094 */ s32   unk94;
    /* 0x098 */ s16   unk98;
    /* 0x09A */ s16   unk9A;
    /* 0x09C */ s32   unk9C;
    /* 0x0A0 */ s32   unkA0;
    /* 0x0A4 */ s32   unkA4;
    /* 0x0A8 */ s32   unkA8;
    /* 0x0AC */ s32   unkAC;
    /* 0x0B0 */ s32   unkB0;
    /* 0x0B4 */ s32   unkB4;
    /* 0x0B8 */ char  pad_0B8[0x8];
    /* 0x0C0 */ s32   unkC0;
    /* 0x0C4 */ char  pad_0C4[0x4];
    /* 0x0C8 */ s16   unkC8;
    /* 0x0CA */ s32   unkCA;
    /* 0x0CE */ char  pad_0CE[0x2];
    /* 0x0D0 */ s16   unkD0;
    /* 0x0D2 */ s16   unkD2;
    /* 0x0D4 */ s16   unkD4;
    /* 0x0D6 */ s16   unkD6;
    /* 0x0D8 */ s16   unkD8;
    /* 0x0DA */ s16   unkDA;
    /* 0x0DC */ s32   unkDC;
    /* 0x0E0 */ s16   unkE0;
    /* 0x0E2 */ s16   unkE2;
    /* 0x0E4 */ s32   unkE4;
    /* 0x0E8 */ s32   unkE8;
    /* 0x0EC */ s32   unkEC;
    /* 0x0F0 */ s32   unkF0;
    /* 0x0F4 */ s32   unkF4;
    /* 0x0F8 */ s16   unkF8;
    /* 0x0FA */ s16   unkFA;
    /* 0x0FC */ s32   unkFC;
    /* 0x100 */ s32   unk100;
    /* 0x104 */ s32   unk104;
    /* 0x108 */ s32   unk108;
    /* 0x10C */ char  pad_10C[0xC];
    /* 0x118 */ s32   unk118;
    /* 0x11C */ char  pad_11C[0x8];
    /* 0x124 */ s32   unk124;
    /* 0x128 */ s32   unk128;
    /* 0x12C */ char  pad_12C[0x4];
    /* 0x130 */ s32   unk130;
    /* 0x134 */ char  pad_134[0x4];
    /* 0x138 */ s32   unk138;
    /* 0x13C */ char  pad_13C[0x5];
    /* 0x141 */ u8    unk141;
    /* 0x142 */ char  pad_142[0x42];
    /* 0x184 */ void* unk184;
    /* 0x188 */ void* unk188;
    /* 0x18C */ s16   unk18C;
    /* 0x18E */ s32   unk18E;
    /* 0x192 */ s16   unk192;
    /* 0x194 */ s16   unk194;
    /* 0x196 */ s32   unk196;
    /* 0x19A */ char  pad_19A[0xA];
    /* 0x1A4 */ s16   unk1A4;
    /* 0x1A6 */ s16   unk1A6;
    /* 0x1A8 */ s32   unk1A8;
    /* 0x1AC */ s32   unk1AC;
    /* 0x1B0 */ s32   unk1B0;
    /* 0x1B4 */ s32   unk1B4;
    /* 0x1B8 */ char  pad_1B8[0x8];
    /* 0x1C0 */ s16   unk1C0;
    /* 0x1C2 */ s16   unk1C2;
    /* 0x1C4 */ s32   unk1C4;
    /* 0x1C8 */ void (*unk1C8)(void*);
    /* 0x1CC */ void (*unk1CC)(void*);
    /* 0x1D0 */ s16  unk1D0;
    /* 0x1D2 */ s16  unk1D2;
    /* 0x1D4 */ s16  unk1D4;
    /* 0x1D6 */ s16  unk1D6;
    /* 0x1D8 */ s16  unk1D8;
    /* 0x1DA */ s16  unk1DA;
    /* 0x1DC */ s32  unk1DC;
    /* 0x1E0 */ s32  unk1E0;
    /* 0x1E4 */ s16  unk1E4;
    /* 0x1E6 */ s16  unk1E6;
    /* 0x1E8 */ s16  unk1E8;
    /* 0x1EA */ s16  unk1EA;
    /* 0x1EC */ s32  unk1EC;
    /* 0x1F0 */ s32  unk1F0;
    /* 0x1F4 */ s16  unk1F4;
    /* 0x1F6 */ s16  unk1F6;
    /* 0x1F8 */ s16  unk1F8;
    /* 0x1FA */ s16  unk1FA;
    /* 0x1FC */ s32  unk1FC;
    /* 0x200 */ s16  unk200;
    /* 0x202 */ s16  unk202;
    /* 0x204 */ s32  unk204;
    /* 0x208 */ s16  unk208;
    /* 0x20A */ s16  unk20A;
    /* 0x20C */ s32  unk20C;
    /* 0x210 */ s16  unk210;
    /* 0x212 */ s16  unk212;
    /* 0x214 */ s32  unk214;
    /* 0x218 */ s32  unk218;
    /* 0x21C */ s32  unk21C;
    /* 0x220 */ s32  unk220;
    /* 0x224 */ s32  unk224;
    /* 0x228 */ char pad_228[0x10];
    /* 0x238 */ s32  unk238;
    /* 0x23C */ s32  unk23C;
    /* 0x240 */ s32  unk240;
    /* 0x244 */ s32  unk244;
    /* 0x248 */ s32  unk248;
    /* 0x24C */ s32  unk24C;
    /* 0x250 */ s32  unk250;
    /* 0x254 */ s32  unk254;
    /* 0x258 */ char pad_258[0x4];
    /* 0x25C */ s32  unk25C;
    /* 0x260 */ s16  unk260;
    /* 0x262 */ s32  unk262;
    /* 0x266 */ char pad_266[0x1A];
    /* 0x280 */ s32  unk280;
    /* 0x284 */ s32  unk284;
    /* 0x288 */ s32  unk288;
    /* 0x28C */ void (*unk28C)(void*);
    /* 0x290 */ s16  unk290;
    /* 0x292 */ s16  unk292;
    /* 0x294 */ s32  unk294;
    /* 0x298 */ s32  unk298;
    /* 0x29C */ s32  unk29C;
    /* 0x2A0 */ char pad_2A0[0x244];
    /* 0x4E4 */ s32  unk4E4;
    /* 0x4E8 */ s32  unk4E8;
    /* 0x4EC */ char pad_4EC[0x28];
    /* 0x514 */ s32  unk514;
    /* 0x518 */ s32  unk518;
    /* 0x51C */ char pad_51C[0x28];
    /* 0x544 */ s32  unk544;
    /* 0x548 */ s32  unk548;
    /* 0x54C */ s32  unk54C;
    /* 0x550 */ char pad_550[0x30];
    /* 0x580 */ s32  unk580;
    /* 0x584 */ char pad_584[0x2];
    /* 0x586 */ s16  unk586;
    /* 0x588 */ s16  unk588;
    /* 0x58A */ char pad_58A[0x6];
};

#endif /* COMBAT_NOISE_BOSS03_H */
