#include "Engine/EasyTask.h"
#include "Engine/Overlay/OverlayDispatcher.h"
#include "Player/Progress.h"
#include "Player/Stats.h"
#include "Save.h"
#include "types.h"

typedef struct {
    /* 0x00000 */ char     unk_00000[0x11584];
    /* 0x11584 */ TaskPool taskPool;
    /* 0x11604 */ char     unk_11604[0x21630 - 0x11604];
    /* 0x21630 */ s32      unk_21630;
    /* 0x21634 */ char     unk_21634[0x2176C - 0x21634];
    /* 0x2176C */ u16      unk_2176C[2];
    /* 0x21770 */ char     unk_21770[0x2177C - 0x21770];
    /* 0x2177C */ s16      unk_2177C;
    /* 0x2177E */ char     unk_2177E[0x21788 - 0x2177E];
    /* 0x21788 */ u32      unk_21788[2];
    /* 0x21790 */ char     unk_21790[0x21ACC - 0x21790];
    /* 0x21ACC */ s32      unk_21ACC;
    /* 0x21AD0 */ s32      unk_21AD0;
    /* 0x21AD4 */ char     unk_21AD4[0x21AF0 - 0x21AD4];
    /* 0x21AF0 */ s32      unk_21AF0;
    /* 0x21AF4 */ s32      unk_21AF4;
    /* 0x21AF8 */ char     unk_21AF8[0x21AFC - 0x21AF8];
    /* 0x21AFC */ s16      unk_21AFC;
    /* 0x21AFE */ char     unk_21AFE[0x21B00 - 0x21AFE];
    /* 0x21B00 */ s32      unk_21B00;
    /* 0x21B04 */ char     unk_21B04[0x21B08 - 0x21B04];
    /* 0x21B08 */ s32      unk_21B08;
    /* 0x21B0C */ s32      unk_21B0C;
    /* 0x21B10 */ char     unk_21B10[0x21CF8 - 0x21B10];
    /* 0x21CF8 */ s32      unk_21CF8;
    /* 0x21CFC */ char     unk_21CFC[0x21D18 - 0x21CFC];
    /* 0x21D18 */ s32      unk_21D18;
    /* 0x21D1C */ s16      unk_21D1C;
    /* 0x21D1E */ s16      unk_21D1E;
    /* 0x21D20 */ s16      unk_21D20;
    /* 0x21D22 */ s16      unk_21D22;
    /* 0x21D24 */ void*    unk_21D24;
    /* 0x21D28 */ s16      unk_21D28;
} RewardTableObject;

extern s32  func_ov030_020aebb0(s32);
extern void func_ov030_020aeb34(s32);
extern void func_ov030_020a9c54(RewardTableObject*, s32, s32);
extern s32  func_ov030_020aed9c(s32);
extern void func_ov030_020ae96c(s32);
extern void func_ov030_020c26bc(s32);
extern s32  func_ov030_020848a4(s32, s32, s32, s32);
extern s32  func_ov030_020848e4(RewardTableObject*, s32);
extern void func_ov030_020a669c(s32); // param is NOT itemID, maybe story progress ID?
extern void func_ov030_020a6738(RewardTableObject*);
extern s32  func_ov030_02084978(RewardTableObject*);
extern s32  func_ov030_020a75c0(RewardTableObject*);

extern void func_ov030_020824a0(void*);
extern void func_ov030_02082c04(void*);
extern void func_ov030_02082bf0(void*);
extern void func_ov030_02082c68(void*);
extern void func_ov030_02082534(void*);
extern void func_ov030_020aec1c(s32);
extern void func_ov030_020aeb70(s32);

extern s32 data_ov030_020d9b6c;
