#include "Combat/Core/Combat.h"
#include "Combat/Core/CombatSprite.h"
#include "EasyFade.h"
#include "Engine/EasyTask.h"
#include "SndMgr.h"

/// MARK: BtlFeat02

typedef struct BtlFeat02 {
    /* 0x000 */ s32 (**stateCallbacks)(struct BtlFeat02*);
    /* 0x004 */ char unk_004[4];

    /* 0x008 */ CombatSprite phaseSpriteMainLeft;
    /* 0x068 */ s32          phaseSpriteMainLeftPosX;
    /* 0x06C */ s32          phaseSpriteMainLeftPosY;

    /* 0x070 */ CombatSprite phaseSpriteMainRight;
    /* 0x0D0 */ s32          phaseSpriteMainRightPosX;
    /* 0x0D4 */ s32          phaseSpriteMainRightPosY;

    /* 0x0D8 */ CombatSprite phaseSpriteSubLeft;
    /* 0x138 */ s32          phaseSpriteSubLeftPosX;
    /* 0x13C */ s32          phaseSpriteSubLeftPosY;

    /* 0x140 */ CombatSprite phaseSpriteSubRight;
    /* 0x1A0 */ s32          phaseSpriteSubRightPosX;
    /* 0x1A4 */ s32          phaseSpriteSubRightPosY;

    /* 0x1A8 */ CombatSprite companionSpriteA;
    /* 0x208 */ s32          unk_208;
    /* 0x20C */ s32          unk_20C;

    /* 0x210 */ CombatSprite companionSpriteB;
    /* 0x270 */ s32          unk_270;
    /* 0x274 */ s32          unk_274;

    /* 0x278 */ s16         companionLayoutMode;
    /* 0x27A */ char        unk_27A[2];
    /* 0x27C */ s32         pairedSpriteSeparationY; // +/- Y separation for symmetric paired sprites
    /* 0x280 */ s32         pairedSpriteBaseY;    // Base Y position for symmetric paired sprites, modified by vertical motion
    /* 0x284 */ s32         shakeScreenOffset;    // Oscillates sprite offset between +/- shakeAmpLimit
    /* 0x288 */ s32         shakeStep;            // Shake amplitude delta when shaking
    /* 0x28C */ s32         shakeDirectionToggle; // Direction to shake
    /* 0x290 */ s32         shakeAmpLimit;        // Shake amplitude limit
    /* 0x294 */ Data*       phasePackData;
    /* 0x298 */ char        unk_298[0x29C - 0x298];
    /* 0x29C */ Data*       rapidFrameMainPackData;
    /* 0x2A0 */ Data*       rapidFrameSubPackData;
    /* 0x2A4 */ BgResource* mainBgCharResLayerC;
    /* 0x2A8 */ BgResource* subBgCharResLayerC;
    /* 0x2AC */ BgResource* mainBgCharResLayerD;
    /* 0x2B0 */ BgResource* subBgCharResLayerD;
    /* 0x2B4 */ s32         unk_2B4;
    /* 0x2B8 */ s32         unk_2B8;
    /* 0x2BC */ char        unk_2BC[0x2DC - 0x2BC];
    /* 0x2DC */ s32         unk_2DC;
    /* 0x2E0 */ s32         unk_2E0;
    /* 0x2E4 */ char        unk_2E4[0x304 - 0x2E4];
    /* 0x304 */ s32         unk_304;
    /* 0x308 */ s32         unk_308;
    /* 0x30C */ char        unk_30C[0x32C - 0x30C];
    /* 0x32C */ s32         unk_32C;
    /* 0x330 */ s32         unk_330;
    /* 0x334 */ char        unk_334[0x354 - 0x334];
    /* 0x354 */ s32         unk_354;
    /* 0x358 */ s32         unk_358;
    /* 0x35C */ s32         unk_35C;
    /* 0x360 */ s32         unk_360;
    /* 0x364 */ s32         unk_364;
    /* 0x368 */ char        unk_368[0x36C - 0x368];
    /* 0x36C */ s32         unk_36C;
    /* 0x370 */ s32         unk_370;
    /* 0x374 */ s32         unk_374;
    /* 0x378 */ s32         unk_378;
    /* 0x37C */ char        unk_37C[0x384 - 0x37C];
    /* 0x384 */ PaletteResource* mainPalette;
    /* 0x388 */ PaletteResource* subPalette;
    /* 0x38C */ char             unk_38C[0x39E - 0x38C];
    /* 0x39E */ u16              phaseCountdown;
    /* 0x3A0 */ s16              stateIndex;
    /* 0x3A2 */ char             unk_3A2[2];
    /* 0x3A4 */ s32              unk_3A4;
    /* 0x3A8 */ s32              unk_3A8;
    /* 0x3AC */ s32              unk_3AC;
    /* 0x3B0 */ s32              bgLayerAOffsetH; // Horizontal offset for BG layer A
    /* 0x3B4 */ s32              bgLayerAOffsetV; // Vertical offset for BG layer A
    /* 0x3B8 */ s32              bgLayerBOffsetH; // Horizontal offset for BG layer B
    /* 0x3BC */ s32              bgLayerBOffsetV; // Vertical offset for BG layer B
    /* 0x3C0 */ s32              bgLayerCOffsetH; // Horizontal offset for BG layer C
    /* 0x3C4 */ s32              bgLayerCOffsetV; // Vertical offset for BG layer C
    /* 0x3C8 */ s32              bgLayerDOffsetH; // Horizontal offset for BG layer D
    /* 0x3CC */ s32              bgLayerDOffsetV; // Vertical offset for BG layer D
    /* 0x3D0 */ u16              stateTimer;
    /* 0x3D2 */ u16              frameStepCountdown;
    /* 0x3D4 */ u16              subStateInterval;
    /* 0x3D6 */ u16              shakeCallbackCooldown;
    /* 0x3D8 */ char             unk_3D8[0x3E0 - 0x3D8];
    /* 0x3E0 */ s32              verticalVelocity;
    /* 0x3E4 */ s32              verticalAcceleration;
    /* 0x3E8 */ char             unk_3E8[0x3F0 - 0x3E8];
    /* 0x3F0 */ s16              unk_3F0;
    /* 0x3F2 */ s16              unk_3F2;
    /* 0x3F4 */ s16              unk_3F4;
} BtlFeat02; // Size: 0x3F8

s32 BtlFeat02_Step_FadeInFast(BtlFeat02* feat);
s32 BtlFeat02_Step_FadeInSlow(BtlFeat02* feat);
s32 BtlFeat02_Step_EndTask(BtlFeat02* feat);
s32 BtlFeat02_Step_RestoreDisplay(BtlFeat02* feat);
s32 BtlFeat02_Step_SetupDisplay(BtlFeat02* feat);
s32 BtlFeat02_Step_LoadPhase1Resources(BtlFeat02* feat);
s32 BtlFeat02_Step_AdvancePhase1RiseMotion(BtlFeat02* feat);
s32 BtlFeat02_Step_DampenMotionAndStartCountdown(BtlFeat02* feat);
s32 BtlFeat02_Step_RunCountdownAndFadeOutMidpoint(BtlFeat02* feat);
s32 BtlFeat02_Step_LoadPhase2Resources(BtlFeat02* feat);
s32 BtlFeat02_Step_AccelerateDive(BtlFeat02* feat);
s32 BtlFeat02_Step_BeginRapidFrameSequence(BtlFeat02* feat);
s32 BtlFeat02_Step_UpdateRapidFrameSequence(BtlFeat02* feat);
s32 BtlFeat02_Step_LoadFinalPhaseResources(BtlFeat02* feat);
s32 BtlFeat02_Step_UpdateFinalPhaseShakeAndTimeout(BtlFeat02* feat);
s32 BtlFeat02_Step_ReleasePhase(BtlFeat02* feat);
