#include "Combat/Core/Combat.h"
#include "Combat/Core/CombatSprite.h"
#include "Combat/Friend/Private/Shiki.h"
#include "EasyFade.h"
#include "Engine/EasyTask.h"
#include "Engine/IO/Input.h"
#include "Engine/Math/Random.h"
#include "Engine/Resources/ResourceMgr.h"
#include "Save.h"
#include "SndMgr.h"
#include <NitroSDK/mi/cpumem.h>

extern BinIdentifier data_ov003_020d77e0;

typedef struct BtlPlayer01 {
    /* 0x000 */ char         unk_000[0x4];
    /* 0x004 */ s16          unk_004;
    /* 0x006 */ char         unk_008[0xC - 0x6];
    /* 0x00C */ s32          unk_00C;
    /* 0x010 */ s16          unk_010;
    /* 0x012 */ u16          unk_012;
    /* 0x014 */ char         unk_014[0x24 - 0x14];
    /* 0x024 */ s32          unk_024;
    /* 0x028 */ s32          unk_028;
    /* 0x02C */ s32          unk_02C;
    /* 0x030 */ s32          unk_030;
    /* 0x034 */ char         unk_034[0x38 - 0x34];
    /* 0x038 */ s32          unk_038;
    /* 0x03C */ char         unk_03C[0x40 - 0x3C];
    /* 0x040 */ s32          unk_040;
    /* 0x044 */ char         unk_044[0x54 - 0x44];
    /* 0x054 */ s32          unk_054;
    /* 0x058 */ char         unk_058[0x5C - 0x58];
    /* 0x05C */ u16          unk_05C;
    /* 0x05E */ char         unk_05E[0x66 - 0x5E];
    /* 0x066 */ s16          unk_066;
    /* 0x068 */ s16          unk_068;
    /* 0x06A */ char         unk_06A[0x70 - 0x6A];
    /* 0x070 */ s16          unk_070;
    /* 0x072 */ s16          unk_072;
    /* 0x074 */ s16          unk_074;
    /* 0x076 */ s16          unk_076;
    /* 0x078 */ char         unk_078[0x7C - 0x78];
    /* 0x07C */ CombatSprite unk_07C;
    /* 0x0DC */ CombatSprite unk_0DC;
    /* 0x13C */ s16          unk_13C;
    /* 0x13E */ s16          unk_13E;
    /* 0x140 */ u16          unk_140;
    /* 0x142 */ s16          unk_142;
    /* 0x144 */ s16          unk_144;
    /* 0x146 */ s16          unk_146;
    /* 0x148 */ s16          unk_148;
    /* 0x14A */ char         unk_14A[0x2];
    /* 0x14C */ void (*unk_14C)(struct BtlPlayer01*);
    /* 0x150 */ s16 unk_150;
    /* 0x152 */ s16 unk_152;
} BtlPlayer01; // Size: 0x154

void func_ov004_020e7f30(BtlPlayer01* player);
void func_ov004_020e8394(BtlPlayer01* player);
void func_ov004_020e84c4(BtlPlayer01* player);
void func_ov004_020e851c(BtlPlayer01* player);
void func_ov004_020e85d8(BtlPlayer01* player);
void func_ov004_020e8790(BtlPlayer01* player);
void func_ov004_020e8878(BtlPlayer01* player);
void func_ov004_020e8a00(BtlPlayer01* player);
void func_ov004_020e8b00(BtlPlayer01* player);
void func_ov004_020e8b94(BtlPlayer01* player);
void func_ov004_020e8d00(BtlPlayer01* player);
s32  BtlPlayer01_RunTask(TaskPool* pool, Task* task, void* args, s32 stage);

const TaskHandle Tsk_BtlPlayer01 = {"Tsk_BtlPlayer01", BtlPlayer01_RunTask, 0x154};

static const u16 data_ov004_020f0068[4] = {3, 3, 4, 5};

static const SpriteAnimEntry data_ov004_020f008c[18] = {
    {1, 3, 2,  0},
    {1, 3, 2,  3},
    {1, 3, 2,  1},
    {1, 3, 2,  2},
    {4, 6, 5,  0},
    {4, 6, 5,  1},
    {4, 6, 5,  2},
