#ifndef SAVE_H
#define SAVE_H

#include "Player/Inventory.h"
#include "Player/Progress.h"
#include "Player/Stats.h"

typedef struct {
    /* 0x0 */ s16 unk_0;
    /* 0x2 */ u16 unk_2;
} UnkSmallStruct;

typedef struct MainData {
    /* 0x0000 */ PlayerStats    playerStats;
    /* 0x002C */ FriendStats    friendStats[3];
    /* 0x0074 */ EquippedPin    equippedPins[6];
    /* 0x00B0 */ StockpilePin   stockpilePins[256];
    /* 0x0AB0 */ MasteredPin    masteredPins[304];
    /* 0x0F70 */ InventoryItem  inventoryItems[472];
    /* 0x16D0 */ s32            unk_16D0;
    /* 0x16D4 */ char           unk_16D4[0x1A18 - 0x16D4];
    /* 0x1A18 */ s32            unk_1A18[35];
    /* 0x1AA4 */ Experience     experience;
    /* 0x1AB0 */ u8             unk_1AB0;
    /* 0x1AB1 */ u8             unk_1AB1;
    /* 0x1AB2 */ u8             unk_1AB2;
    /* 0x1AB3 */ u8             unk_1AB3;
    /* 0x1AB4 */ u16            unk_1AB4;
    /* 0x1AB6 */ u16            unk_1AB6;
    /* 0x1AB8 */ u8             unk_1AB8;
    /* 0x1AB9 */ u8             unk_1AB9;
    /* 0x1ABA */ u16            unk_1ABA[3];
    /* 0x1AC0 */ u16            unk_1AC0;
    /* 0x1AC2 */ u16            unk_1AC2;
    /* 0x1AC4 */ char           unk_1AC4[0x1AF2 - 0x1AC4];
    /* 0x1AF2 */ u16            unk_1AF2;
    /* 0x1AF4 */ char           unk_1AF4[0x1B24 - 0x1AF4];
    /* 0x1B24 */ u16            unk_1B24;
    /* 0x1B26 */ char           unk_1B26[0x1D7C - 0x1B26];
    /* 0x1D7C */ u16            unk_1D7C;
    /* 0x1D7E */ char           unk_1D7E[0x1D84 - 0x1D7E];
    /* 0x1D84 */ u16            unk_1D84;
    /* 0x1D86 */ char           unk_1D86[0x1D94 - 0x1D86];
    /* 0x1D94 */ u32            unk_1D94;
    /* 0x1D98 */ u8             unk_1D98[41];
    /* 0x1DC1 */ char           unk_1DC1[1];
    /* 0x1DC2 */ EquippedPin    pinLayouts[4][6];
    /* 0x1EB2 */ u8             unk_1EB2[280];
    /* 0x1FCA */ u16            unk_1FCA;
    /* 0x1FCC */ UnkSmallStruct unk_1FCC[96];
    /* 0x214C */ u16            unk_214C;
    /* 0x214E */ char           unk_214E[0x22CC - 0x214E];
    /* 0x22CC */ SecretReport   secretReports[22];
    /* 0x2324 */ u16            unk_2324;
    /* 0x2326 */ u16            unk_2326[16];
    /* 0x2346 */ u16            unk_2346;
    /* 0x2348 */ u16            unk_2348;
    /* 0x234A */ char           unk_234A[0x242C - 0x234A];
    /* 0x242C */ u32            unk_242C;
    /* 0x2430 */ u16            unk_2430;
    /* 0x2432 */ u16            unk_2432;
    /* 0x2434 */ u16            unk_2434;
    /* 0x2436 */ u16            unk_2436;
    /* 0x2438 */ u16            unk_2438;
    /* 0x243A */ u16            unk_243A;
    /* 0x243C */ u16            unk_243C;
    /* 0x243E */ u16            unk_243E;
    /* 0x2440 */ char           unk_2440[0x244C - 0x2440];
    /* 0x244C */ s32            unk_244C;
    /* 0x2450 */ s32            unk_2450;
    /* 0x2454 */ s32            unk_2454;
    /* 0x2458 */ s16            unk_2458;
    /* 0x245C */ char           unk_245C[0x246C - 0x245C];
    /* 0x246C */ u32            unk_246C;
    /* 0x2470 */ char           unk_2470[0x2474 - 0x2470];
    /* 0x2474 */ u32            unk_2474;
    /* 0x2478 */ u32            unk_2478;
    /* 0x247C */ u32            unk_247C;
    /* 0x2480 */ u32            unk_2480;
    /* 0x2484 */ u32            unk_2484;
    /* 0x2488 */ char           unk_2488[0x24A4 - 0x2488];
    /* 0x24A4 */ u16            unk_24A4;
    /* 0x24A6 */ char           unk_24A6[0x24B4 - 0x24A6];
    /* 0x24B4 */ u16            unk_24B4;
    /* 0x24B6 */ u16            unk_24B6;
    /* 0x24B8 */ u32            unk_24B8;
    /* 0x24BC */ u16            unk_24BC;
    /* 0x24BE */ u16            unk_24BE;
    /* 0x24C0 */ u16            unk_24C0;
    /* 0x24C2 */ u16            unk_24C2;
    /* 0x24C4 */ u32            unk_24C4;
    /* 0x24C8 */ s32            unk_24C8[2];
    /* 0x24D0 */ char           unk_24D0[0x24E8 - 0x24D0];
    /* 0x24E8 */ u16            unk_24E8;
    /* 0x24EA */ char           unk_24EA[0x2648 - 0x24EA];
    /* 0x2648 */ s16            unk_2648;
    /* 0x264A */ s16            unk_264A;
    /* 0x264C */ s16            unk_264C;
    /* 0x264E */ s16            unk_264E;
    /* 0x2650 */ u16            unk_2650;
    /* 0x2652 */ u16            unk_2652;
    /* 0x2654 */ u16            unk_2654;
    /* 0x2656 */ u16            unk_2656;
    /* 0x2658 */ u16            unk_2658;
    /* 0x265A */ u16            unk_265A;
    /* 0x265C */ u16            unk_265C;
    /* 0x265E */ u16            unk_265E;
    /* 0x2660 */ u16            unk_2660;
    /* 0x2662 */ u16            unk_2662;
    /* 0x2664 */ u16            unk_2664;
    /* 0x2666 */ u16            unk_2666;
    /* 0x2668 */ u16            unk_2668;
    /* 0x266A */ u16            unk_266A;
    /* 0x266C */ u16            unk_266C;
    /* 0x266E */ u16            unk_266E;
    /* 0x2670 */ u16            unk_2670;
    /* 0x2672 */ u16            unk_2672;
    /* 0x2674 */ u16            unk_2674;
    /* 0x2676 */ u16            unk_2676;
    /* 0x2678 */ u16            unk_2678;
    /* 0x267A */ u16            unk_267A;
    /* 0x267C */ s16            unk_267C;
    /* 0x267E */ s16            unk_267E;
    /* 0x2680 */ s16            unk_2680;
    /* 0x2682 */ s16            unk_2682;
    /* 0x2684 */ s16            unk_2684;
    /* 0x2686 */ s16            unk_2686;
    /* 0x2688 */ s16            unk_2688;
    /* 0x268A */ s16            unk_268A;
    /* 0x268C */ s16            unk_268C;
    /* 0x268E */ s16            unk_268E;
    /* 0x2690 */ s16            unk_2690;
    /* 0x2692 */ s16            unk_2692;
    /* 0x2694 */ s16            unk_2694;
    /* 0x2696 */ s16            unk_2696;
    /* 0x2698 */ s16            unk_2698;
    /* 0x269A */ s16            unk_269A;
    /* 0x269C */ s16            unk_269C;
    /* 0x269E */ s16            unk_269E;
    /* 0x26A0 */ s16            unk_26A0;
    /* 0x26A2 */ s16            unk_26A2;
    /* 0x26A4 */ s16            unk_26A4;
    /* 0x26A6 */ s16            unk_26A6;
    /* 0x26A8 */ s16            unk_26A8;
    /* 0x26AA */ u16            unk_26AA;
    /* 0x26AC */ char           unk_26AC[0x26B0 - 0x26AC];
    /* 0x26B0 */ u16            unk_26B0;
    /* 0x26B2 */ u16            unk_26B2;
    /* 0x26B4 */ u16            unk_26B4;
    /* 0x26B6 */ u16            unk_26B6;
    /* 0x26B8 */ u16            unk_26B8;
    /* 0x26BA */ u16            unk_26BA;
    /* 0x26BC */ u16            unk_26BC;
    /* 0x26BE */ u16            unk_26BE;
    /* 0x26C0 */ u16            unk_26C0;
    /* 0x26C2 */ u16            unk_26C2;
    /* 0x26C4 */ u16            unk_26C4;
    /* 0x26C6 */ u16            unk_26C6;
    /* 0x26C8 */ u16            unk_26C8;
    /* 0x26CA */ u16            unk_26CA;
    /* 0x26CC */ u16            unk_26CC;
    /* 0x26CE */ u16            unk_26CE;
    /* 0x26D0 */ u16            unk_26D0;
    /* 0x26D2 */ u16            unk_26D2;
    /* 0x26D4 */ u16            unk_26D4;
    /* 0x26D6 */ u16            unk_26D6;
    /* 0x26D8 */ u16            unk_26D8;
    /* 0x26DA */ u16            unk_26DA;
    /* 0x26DC */ u16            unk_26DC;
    /* 0x26DE */ char           unk_26DE[0x30FC - 0x26DE];
    /* 0x30FC */ s16            unk_30FC;
    /* 0x30FE */ s16            unk_30FE;
    /* 0x3100 */ s16            unk_3100;
    /* 0x3102 */ s16            unk_3102;
    /* 0x3104 */ s16            unk_3104;
    /* 0x3106 */ s16            unk_3106;
    /* 0x3108 */ s16            unk_3108;
    /* 0x310A */ char           unk_310A[0x310C - 0x310A];
    /* 0x310C */ void*          unk_310C;
    /* 0x3110 */ char           unk_3110[0x3112 - 0x3110];
    /* 0x3112 */ u16            unk_3112;
    /* 0x3114 */ u16            unk_3114;
    /* 0x3116 */ u16            unk_3116;
    /* 0x3118 */ u16            unk_3118;
    /* 0x311A */ u16            unk_311A;
    /* 0x311C */ u16            unk_311C;
    /* 0x311E */ char           unk_311E[0x3124 - 0x311E];
    /* 0x3124 */ s32            unk_3124;
    /* 0x3128 */ s16            unk_3128;
    /* 0x312A */ char           unk_312A[0x312C - 0x312A];
    /* 0x312C */ s32            unk_312C;
    /* 0x3130 */ s32            unk_3130;
    /* 0x3134 */ s32            unk_3134;
    /* 0x3138 */ char           unk_3138[0x313C - 0x3138];
    /* 0x313C */ s32            unk_313C;
    /* 0x3140 */ u8             unk_3140;
    /* 0x3141 */ u8             unk_3141;
    /* 0x3142 */ u16            unk_3142;
    /* 0x3144 */ char           unk_3144[0x3234 - 0x3144];
    /* 0x3234 */ s32            unk_3234;
    /* 0x3238 */ u32            unk_3238;
    /* 0x323E */ u16            unk_323E;
    /* 0x3240 */ char           unk_3240[0x341C - 0x3240];
    /* 0x341C */ u8             unk_341C;
} MainData;

// data_02071cf0 - system state structure
struct SystemState {
    /* 0x00 */ u16      unk_00;
    /* 0x02 */ u16      unk_02;
    /* 0x04 */ void*    globalFriendData;
    /* 0x08 */ s32      unk_08;
    /* 0x0C */ s32      lockID;
    /* 0x10 */ s32      unk_10;
    /* 0x14 */ s32      unk_14;
    /* 0x18 */ s32      unk_18;
    /* 0x1C */ s32      unk_1C;
    /* 0x20 */ MainData unk_20;
};

extern struct SystemState data_02071cf0;

/**
 * @brief Reset all gameplay-related data to their initial state. This includes all player and friend stats, all pins, all
 * equipment, all story progress, and all collections.
 */
void Savefile_ResetAllGameplay(MainData* arg0);

#endif // SAVE_H