#include "DatMgr.h"
#include "EasyTask.h"
#include "common_data.h"
#include <types.h>

/* Forward declaration for the main boss/object struct used in this overlay. */
typedef struct Ov016Obj Ov016Obj;

/* Compact sprite parameter bundle used for simple animation setup. */
typedef struct {
    /* 0x00 */ u16 unk0;
    /* 0x02 */ u16 unk2;
    /* 0x04 */ u16 unk4;
    /* 0x06 */ u16 unk6;
} Ov016SpriteParams;

/* Runtime sprite instance with extended state and animation fields. */
typedef struct {
    /* 0x00 */ u16 unk0;
    /* 0x02 */ u16 unk2;
    /* 0x04 */ u16 unk4;
    /* 0x06 */ u16 unk6;
    /* 0x08 */ u8  pad_08[0x14];
    /* 0x1C */ u16 unk1C;
    /* 0x1E */ u8  pad_1E[0x2];
    /* 0x20 */ u16 unk20;
    /* 0x22 */ u8  pad_22[0x4];
    /* 0x26 */ u16 unk26;
    /* 0x28 */ u16 unk28;
    /* 0x2A */ u16 unk2A;
    /* 0x2C */ s32 unk2C;
} Ov016Sprite;

/* Animation configuration for spawning or initializing a sprite. */
typedef struct {
    /* 0x00 */ Ov016SpriteParams        params;
    /* 0x08 */ const void*              unk8;
    /* 0x0C */ const Ov016SpriteParams* unkC;
    /* 0x10 */ u16                      unk10;
    /* 0x12 */ u16                      unk12;
    /* 0x14 */ u16                      unk14;
    /* 0x16 */ u16                      unk16;
} Ov016AnimConfig;

/* Resource reference entry used by the animation system. */
typedef struct {
    /* 0x00 */ u32         unk0;
    /* 0x04 */ const char* path;
} Ov016ResRef;

/* Task data wrapper used by the EasyTask pool for this overlay. */
typedef struct {
    /* 0x00 */ u8        pad_18[0x18];
    /* 0x18 */ Ov016Obj* unk18;
} Ov016Task;

/* Actor root header used to find actor-specific data. */
typedef struct {
    /* 0x00 */ u8  pad_0[0x8];
    /* 0x08 */ u8* unk8;
} Ov003ActorRoot;

/* Global overlay state block for ov003 (shared world state). */
typedef struct {
    /* 0x000000 */ u8               pad_3D350[0x3D350];
    /* 0x003D350 */ Ov003ActorRoot* unk3D350;
    /* 0x003D354 */ u8              pad_3D7CC[0x478];
    /* 0x003D7CC */ s32             unk3D7CC;
    /* 0x003D7D0 */ u8              pad_3D824[0x54];
    /* 0x003D824 */ s32             unk3D824;
    /* 0x003D828 */ u8              pad_3D878[0x50];
    /* 0x003D878 */ u32             unk3D878;
    /* 0x003D87C */ u8              pad_3D898[0x1C];
    /* 0x003D898 */ Ov016Obj*       unk3D898;
    /* 0x003D89C */ Ov016Obj*       unk3D89C;
    /* 0x003D8A0 */ Ov016Obj*       unk3D8A0;
    /* 0x003D8A4 */ u8              pad_3D8AC[0x8];
    /* 0x003D8AC */ void*           unk3D8AC;
    /* 0x003D8B0 */ u8              pad_3D8B4[0x4];
    /* 0x003D8B4 */ void*           unk3D8B4;
} Ov003Global;

/* Simple quad of u16 values, often used for dimensions or indices. */
typedef struct {
    /* 0x00 */ u16 unk0;
    /* 0x02 */ u16 unk2;
    /* 0x04 */ u16 unk4;
    /* 0x06 */ u16 unk6;
} Ov016U16Quad;

/* Spawn metadata for effects/obstacles (dimensions and timing). */
typedef struct {
    /* 0x00 */ u16 unk0;
    /* 0x02 */ u16 unk2;
    /* 0x04 */ u16 unk4;
    /* 0x06 */ u16 unk6;
    /* 0x08 */ u16 unk8;
    /* 0x0A */ u16 unkA;
} Ov016SpawnMeta;

/* Spawn arguments for tasks that create effects or obstacles. */
typedef struct {
    /* 0x00 */ s32             unk0;
    /* 0x04 */ s32             unk4;
    /* 0x08 */ Ov016SpawnMeta* unk8;
    /* 0x0C */ s32             unkC;
    /* 0x10 */ s32             unk10;
    /* 0x14 */ s32             unk14;
} Ov016SpawnArgs;

/* Basic initializer used by several task stages. */
typedef struct {
    /* 0x00 */ s32 unk0;
    /* 0x04 */ s32 unk4;
    /* 0x08 */ s32 unk8;
    /* 0x0C */ s32 unkC;
} Ov016InitArgs4;

/* Boss spawn arguments including animation and geometry data. */
typedef struct {
    /* 0x00 */ u16                 unk0;
    /* 0x02 */ u16                 unk2;
    /* 0x04 */ u32                 pad_04;
    /* 0x08 */ const Ov016U16Quad* unkC;
} Ov016BossSpawnArgs;

/* Simple 3D vector-like container used for positions. */
typedef struct {
    /* 0x00 */ s32 unk0;
    /* 0x04 */ s32 unk4;
    /* 0x08 */ s32 unk8;
} Ov016Vec3;

#define OV003_TASK_POOL  ((void*)((u8*)data_ov003_020e71b8 + 0x808C))
#define OV003_LIST_3D8AC ((void*)((u8*)data_ov003_020e71b8 + 0x3D8AC))
#define OV003_LIST_3D8B4 ((void*)((u8*)data_ov003_020e71b8 + 0x3D8B4))

typedef s32 (*Ov016StageFunc)(void* arg0, Ov016Task* arg1, void* arg2);

struct Ov016Obj {
    /* 0x000 */ u16 unk0;
    /* 0x002 */ u16 unk2;
    /* 0x004 */ u16 unk4;
    /* 0x006 */ u16 unk6;
    /* Sprite/state header and linkage. */
    /* 0x008 */ u8        pad_08[0x18 - 0x08];
    /* 0x018 */ Ov016Obj* unk18;
    /* 0x01C */ u8        pad_1C[0x20 - 0x1C];
    /* Primary position/velocity and movement parameters. */
    /* 0x020 */ s32 unk20;
    /* 0x024 */ s32 unk24;
    /* 0x028 */ s32 unk28;
    /* 0x02C */ s32 unk2C;
    /* 0x030 */ s32 unk30;
    /* 0x034 */ s16 unk34;
    /* 0x036 */ s16 unk36;
    /* 0x038 */ s32 unk38;
    /* 0x03C */ s32 unk3C;
    /* 0x040 */ s32 unk40;
    /* 0x044 */ s32 unk44;
    /* 0x048 */ s32 unk48;
    /* 0x04C */ s32 unk4C;
    /* 0x050 */ u8  pad_50[0x54 - 0x50];
    /* Flags and timers used by AI/phase logic. */
    /* 0x054 */ s32 unk54;
    /* 0x058 */ s32 unk58;
    /* 0x05C */ s16 unk5C;
    /* 0x05E */ s16 unk5E;
    /* Trajectory and spawn configuration. */
    /* 0x060 */ s32 unk60;
    /* 0x064 */ s32 unk64;
    /* 0x068 */ s32 unk68;
    /* 0x06C */ s16 unk6C;
    /* 0x06E */ s16 unk6E;
    /* 0x070 */ s32 unk70;
    /* 0x074 */ s16 unk72;
    /* 0x074 */ s16 unk74;
    /* 0x076 */ s16 unk76;
    /* 0x078 */ s16 unk78;
    /* 0x07A */ s16 unk7A;
    /* 0x07C */ s16 unk7C;
    /* 0x07E */ s16 unk7E;
    /* 0x080 */ s16 unk80;
    /* 0x082 */ s16 unk82;
    /* 0x084 */ s16 unk84;
    /* 0x086 */ s16 unk86;
    /* 0x088 */ s16 unk88;
    /* 0x08A */ s16 unk8A;
    /* 0x08C */ s16 unk8C;
    /* 0x08E */ u16 unk8E;
    /* Render state and sprite instances are interleaved here. */
    /* 0x090 */ u8  pad_90[0x96 - 0x90];
    /* 0x096 */ s16 unk96;
    /* 0x098 */ u8  pad_98[0xA4 - 0x98];
    /* 0x0A4 */ s16 unkA4;
    /* 0x0A6 */ s16 unkA6;
    /* 0x0A8 */ u8  pad_A8[0xB4 - 0xA8];
    /* 0x0B4 */ s32 unkB4;
    /* 0x0B8 */ u8  pad_B8[0xC0 - 0xB8];
    /* 0x0C0 */ s16 unkC0;
    /* 0x0C2 */ s16 unkC2;
    /* 0x0C4 */ s16 unkC4;
    /* 0x0C6 */ u8  pad_C6[0xC8 - 0xC6];
    /* 0x0C8 */ s16 unkC8;
    /* 0x0CA */ u16 unkCA;
    /* 0x0CC */ u8  pad_CC[0xEC - 0x0CC];
    /* 0x0EC */ s32 unkEC;
    /* 0x0F0 */ u8  pad_F0[0x108 - 0x0F0];
    /* 0x108 */ s32 unk108;
    /* 0x10C */ u8  pad_10C[0x14C - 0x10C];
    /* 0x14C */ s32 unk14C;
    /* 0x150 */ u8  pad_150[0x184 - 0x150];
    /* Relationships to other objects and task data. */
    /* 0x184 */ Ov016Obj* unk184;
    /* 0x188 */ void*     unk188;
    /* 0x18C */ u16       unk18C;
    /* 0x18E */ s16       unk18E;
    /* 0x190 */ s32       unk190;
    /* 0x194 */ s32       unk194;
    /* 0x198 */ u8        pad_198[0x1A4 - 0x198];
    /* 0x1A4 */ s16       unk1A4;
    /* 0x1A6 */ s16       unk1A6;
    /* 0x1A8 */ u8        pad_1A8[0x1C0 - 0x1A8];
    /* AI state callbacks and counters. */
    /* 0x1C0 */ s16 unk1C0;
    /* 0x1C2 */ u16 unk1C2;
    /* 0x1C4 */ s16 unk1C4;
    /* 0x1C6 */ s16 unk1C6;
    /* 0x1C8 */ void (*unk1C8)(Ov016Obj*);
    /* 0x1CC */ void (*unk1CC)(Ov016Obj*);
    /* 0x1D0 */ s32       unk1D0;
    /* 0x1D4 */ s32       unk1D4;
    /* 0x1D8 */ s32       unk1D8;
    /* 0x1DC */ s32       unk1DC;
    /* 0x1E0 */ Ov016Obj* unk1E0;
    /* 0x1E4 */ Ov016Obj* unk1E4;
    /* 0x1E8 */ s32       unk1E8;
    /* 0x1EC */ s32       unk1EC;
    /* 0x1F0 */ s32       unk1F0;
    /* 0x1F4 */ u8        pad_1F4[0x284 - 0x1F4];
    /* Boss core data and sub-state callback. */
    /* 0x284 */ u16 unk284;
    /* 0x286 */ u16 unk286;
    /* 0x288 */ u16 unk288;
    /* 0x28A */ u16 unk28A;
    /* 0x28C */ void (*unk28C)(Ov016Obj*);
    /* 0x290 */ s16 unk290;
    /* 0x292 */ s16 unk292;
    /* 0x294 */ s32 unk294;
};

void                EasyFade_FadeBothDisplays(s32, s32, s32);                                          /* extern */
s32                 EasyFade_IsFading();                                                               /* extern */
s32                 FX_Divide(s32, s32);                                                               /* extern */
s32                 RNG_Next(s32);                                                                     /* extern */
u16                 func_02002bc4(const void*, s32, s32, s32, s32);                                    /* extern */
s32                 func_0200a968(s32, void*, s32, s32);                                               /* extern */
void                func_0200afec(s32, s32);                                                           /* extern */
s32                 func_0200ea4c(void*);                                                              /* extern */
